; domain
(define (domain manito)
    (:requirements :strips)

    (:predicates 
        (en ?bloque ?donde)
        (pos ?garra ?donde)

        (libre ?quien)
        (apilado ?bloque)
        (dismover ?garra)
        (pinned ?garra)

        (torre ?debajo ?sobre)

        (pisog ?garra ?altura)
        (pisob ?bloque ?altura)

        (ocupado ?garra)
        (desocupado ?garra)
        
        (camino ?donde ?hasta)
        (alt ?al1 ?al2))


    (:action movehorizontal
        :parameters (?garra ?donde ?hasta)
        :precondition (and
            (pos ?garra ?donde)
            (camino ?donde ?hasta)
            (dismover ?garra)
        )
        :effect (and
            (pos ?garra ?hasta)
            (not (pos ?garra ?donde))
        )
    )

    (:action moverarriba
        :parameters (?garra ?alt ?alt2)
        :precondition (and
            (pisog ?garra ?alt)
            (alt ?alt ?alt2)
            (pinned ?garra)
        )
        :effect (and
            (pisog ?garra ?alt2)
            (not (pisog ?garra ?alt))
            (not (pinned ?garra))
            (dismover ?garra)
        )
    )

     (:action moverabajo
        :parameters (?garra ?alt ?alt2)
        :precondition (and
            (pisog ?garra ?alt)
            (alt ?alt ?alt2)
            (dismover ?garra)
        )
        :effect (and
            (pisog ?garra ?alt2)
            (not (pisog ?garra ?alt))
            (not (dismover ?garra))
            (pinned ?garra)
        )
    )

    (:action tomar
        :parameters (?garra ?bloque ?donde ?alt)
        :precondition (and
            (pos ?garra ?donde)
            (en ?bloque ?donde)
            (pisog ?garra ?alt)
            (pisob ?bloque ?alt)
            (desocupado ?garra)
            (libre ?bloque)
        )
        :effect (and
            (ocupado ?garra)
            (not (desocupado ?garra))
            (en ?bloque ?garra)
            (not (en ?bloque ?donde))
            (not (pisob ?bloque ?alt))
            (libre ?donde)
            (libre ?bloque)
        )
    )

    (:action soltar 
        :parameters (?garra ?bloque ?donde ?alt)
        :precondition (and
            (pos ?garra ?donde)
            (en ?bloque ?garra)
            (pisog ?garra ?alt)
            (ocupado ?garra)
            (libre ?donde)
        )
        :effect (and
            (not (ocupado ?garra))
            (desocupado ?garra)
            (not (en ?bloque ?garra))
            (en ?bloque ?donde)
            (pisob ?bloque ?alt)
            (not (libre ?donde))
        )
    )

    
    (:action desapilar
        :parameters (?garra ?bloque ?donde ?alt ?bloque2)
        :precondition (and
            (pos ?garra ?donde)
            (en ?bloque ?donde)
            (en ?bloque2 ?donde)

            (pisog ?garra ?alt)
            (pisob ?bloque ?alt)
            (pisob ?bloque2 ?alt)
            
            (desocupado ?garra)

            (libre ?bloque)
            (apilado ?bloque2)
            (torre ?bloque2 ?bloque)
            )
            
            :effect (and
            (not (torre ?bloque2 ?bloque))
            (not (libre ?bloque))
            (not (apilado ?bloque2))
            (libre ?bloque2)
            (ocupado ?garra)
            (not (desocupado ?garra))
            (en ?bloque ?garra)
            (not (en ?bloque ?donde))
            (not (pisob ?bloque ?alt))
            )
    )

    (:action apilar
        :parameters (?garra ?bloque ?bloque2 ?donde ?alt)
        :precondition (and
            (pos ?garra ?donde)
            (en ?bloque ?garra)
            (en ?bloque2 ?donde)

            (pisog ?garra ?alt)
            (pisob ?bloque2 ?alt)
            
            (ocupado ?garra)
            (libre ?bloque2)
            )
            
            :effect (and
            (torre ?bloque2 ?bloque)
            (libre ?bloque)
            (apilado ?bloque2)
            (not (libre ?bloque2))
            (not (ocupado ?garra))
            (desocupado ?garra)
            (not (en ?bloque ?garra))
            (en ?bloque ?donde)
            (pisob ?bloque ?alt)
            )
    )
)

; problem
(define (problem goal-green-red-blue)
    (:domain manito)

    (:objects
        greenb blueb
        garra
        xygarra xygreen xyblue
        zgreen zgarra zblue
        )
    (:init
        (en greenb xygreen)
        (en blueb xyblue)

        (pisob greenb zgreen)
        (pisob blueb zblue)

        (libre greenb)
        (libre blueb)
        
        (pos garra xygarra)
        (pisog garra zgarra)

        (camino xygreen xygarra)
        (camino xygarra  xygreen)
        
        (camino xygarra  xyblue)
        (camino xyblue xygarra)

        (camino xygreen  xyblue)
        (camino xyblue xygreen)

        (alt zgarra zgreen)
        (alt zgreen zgarra)
        
        (alt zblue zgarra)
        (alt zgarra zblue)
        
        (alt zblue zgreen)
        (alt zgreen zblue)

        (dismover garra)

        (desocupado garra)
    )
    (:goal 
        (and 
            (torre greenb blueb)
        )
    )
)

; plan
1. (movehorizontal garra xygarra xyblue)
   deleted: (pos garra xygarra)
   added: (pos garra xyblue)
   goals met: 0 of 1
2. (moverabajo garra zgarra zblue)
   deleted: (pisog garra zgarra) (dismover garra)
   added: (pisog garra zblue) (pinned garra)
   goals met: 0 of 1
3. (tomar garra blueb xyblue zblue)
   deleted: (desocupado garra) (en blueb xyblue) (pisob blueb zblue)
   added: (ocupado garra) (en blueb garra) (libre xyblue)
   goals met: 0 of 1
4. (moverarriba garra zblue zgreen)
   deleted: (pisog garra zblue) (pinned garra)
   added: (pisog garra zgreen) (dismover garra)
   goals met: 0 of 1
5. (movehorizontal garra xyblue xygreen)
   deleted: (pos garra xyblue)
   added: (pos garra xygreen)
   goals met: 0 of 1
6. (apilar garra blueb greenb xygreen zgreen)
   deleted: (libre greenb) (ocupado garra) (en blueb garra)
   added: (torre greenb blueb) (apilado greenb) (desocupado garra) (en blueb xygreen) (pisob blueb zgreen)
   goals met: 1 of 1
